# SQLite Tutorial

Documentation at: https://docs.python.org/3/library/sqlite3.html

# Quire of SQLite

* Data Types .
* No Right or Full Outer Joins.
* Alter Table is very useful add, Remove , column and table name.
* Tables default to having a unique integer rowid column.
* SQLite is a library not a service.
* In-Memory Database Feature.

- Python database is portable, and the program is also portable so both can give an advantage in case of portability
- It is an interface for associating the SQL database server from Python and uses the DB-API of Python to work.

load the sqlite package

In [1]:
import sqlite3

print(sqlite3.sqlite_version)

3.40.1

Connect to the database.

In [2]:
conn = sqlite3.connect('school.db')

In [3]:
# create file in test.db table 
onn = sqlite3.connect('test.db')
print("Opened database successfully")

# create table 
conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
print("Table created successfully")

conn.close()

Opened database successfully
Table created successfully

create cursor to execute statement

In [361]:
cur = conn.cursor()
cur.execute('select * from student')

In [362]:
rows= cur.fetchall()
print(rows)

[(1, 'alyar', '2', 'RED', 'Male', 'A', 'ali', 'pabbi', 333, 2000, 345, 1000.0, 400.0, 300.0, 300.0, 300.0, 'Paid'), (3, 'arfa jani', '1', 'YELLOW', 'Female', 'D', 'maryam', 'PABBI', 335, 1000, 345, 1200.0, 200.0, 1000.0, 1000.0, 400.0, 'Unpaid'), (4, 'azam', '3', 'RED', 'Male', 'A', 'ali', 'pabbi', 345, 3000, 3331234567, 300.0, 0.0, 0.0, 0.0, 0.0, 'Paid'), (5, 'bacha', '5', 'RED', 'Male', 'A', 'tariq', 'pabbi', 123456789, 5000, 3331234567, 1000.0, 1000.0, 3000.0, 3000.0, 1000.0, 'Paid'), (6, 'ali khan', '1', 'RED', 'Male', 'A', 'tariq', 'pabbi', 1234567890, 1000, 3331234567, 1000.0, 500.0, 1000.0, 1000.0, 200.0, 'Paid'), (7, 'hamza', '4', 'RED', 'Male', 'A', 'tatiq', 'pabbi', 12121212, 2000, 3331234567, 1000.0, 2000.0, 2000.0, 1000.0, 1000.0, 'Paid'), (8, 'maryam', '3', 'BLUE', 'Female', 'B', 'tariq', 'pabbi', 3331234567, 1000, 3331234567, 0.0, 0.0, 0.0, 0.0, 0.0, 'Unpaid'), (9, 'alyar Tariq', '1', 'BLUE', 'Male', 'B', 'tariq', 'usman abad', 3339139164, 1000, 3331234567, 500.0, 300.0, 200.0, 1000.0, 200.0, 'Unpaid'), (10, 'nimra', '3', 'GREEN', 'Female', 'C', 'maryam', 'pabbi', 331, 2000, 3331234567, 200.0, 0.0, 200.0, 1000.0, 200.0, 'Unpaid')]

In [363]:
for row in cur.execute('SELECT * FROM student'):
    print(row)

(1, 'alyar', '2', 'RED', 'Male', 'A', 'ali', 'pabbi', 333, 2000, 345, 1000.0, 400.0, 300.0, 300.0, 300.0, 'Paid')
(3, 'arfa jani', '1', 'YELLOW', 'Female', 'D', 'maryam', 'PABBI', 335, 1000, 345, 1200.0, 200.0, 1000.0, 1000.0, 400.0, 'Unpaid')
(4, 'azam', '3', 'RED', 'Male', 'A', 'ali', 'pabbi', 345, 3000, 3331234567, 300.0, 0.0, 0.0, 0.0, 0.0, 'Paid')
(5, 'bacha', '5', 'RED', 'Male', 'A', 'tariq', 'pabbi', 123456789, 5000, 3331234567, 1000.0, 1000.0, 3000.0, 3000.0, 1000.0, 'Paid')
(6, 'ali khan', '1', 'RED', 'Male', 'A', 'tariq', 'pabbi', 1234567890, 1000, 3331234567, 1000.0, 500.0, 1000.0, 1000.0, 200.0, 'Paid')
(7, 'hamza', '4', 'RED', 'Male', 'A', 'tatiq', 'pabbi', 12121212, 2000, 3331234567, 1000.0, 2000.0, 2000.0, 1000.0, 1000.0, 'Paid')
(8, 'maryam', '3', 'BLUE', 'Female', 'B', 'tariq', 'pabbi', 3331234567, 1000, 3331234567, 0.0, 0.0, 0.0, 0.0, 0.0, 'Unpaid')
(9, 'alyar Tariq', '1', 'BLUE', 'Male', 'B', 'tariq', 'usman abad', 3339139164, 1000, 3331234567, 500.0, 300.0, 200.0, 1000.0, 200.0, 'Unpaid')
(10, 'nimra', '3', 'GREEN', 'Female', 'C', 'maryam', 'pabbi', 331, 2000, 3331234567, 200.0, 0.0, 200.0, 1000.0, 200.0, 'Unpaid')

In [9]:
for row in cur.execute('SELECT * FROM student limit 3'):
    print(row)

(1, 'alyar', '2', 'RED', 'Male', 'A', 'ali', 'pabbi', 333, 2000, 345, 1000.0, 400.0, 300.0, 300.0, 300.0, 'Paid')
(3, 'arfa jani', '1', 'YELLOW', 'Female', 'D', 'maryam', 'PABBI', 335, 1000, 345, 1200.0, 200.0, 1000.0, 1000.0, 400.0, 'Unpaid')
(4, 'azam', '3', 'RED', 'Male', 'A', 'ali', 'pabbi', 345, 3000, 3331234567, 300.0, 0.0, 0.0, 0.0, 0.0, 'Paid')

# pandas with Sqlite

In [10]:
import pandas as pd

In [293]:
# convert query results to a dataframe
pd.read_sql_query("SELECT sql FROM sqlite_master ", conn)

                                                  sql
0   CREATE TABLE student (\n            id INTEGER...
1              CREATE TABLE sqlite_sequence(name,seq)
2   CREATE TABLE teacher (\n            id INTEGER...
3   CREATE TABLE staff (\n            id INTEGER P...
4   CREATE TABLE finance \n        \n            (...
5   CREATE TABLE person(\n                  id INT...
6   CREATE TABLE dimdate (\n    DateKey           ...
7   CREATE TABLE "factinternetsales" (\n"ProductKe...
8   CREATE TABLE "dimasale" (\n"index" INTEGER,\n ...
9   CREATE INDEX "ix_dimasale_index"ON "dimasale" ...
10  CREATE UNIQUE INDEX idx_salesterritorykey on d...
11  CREATE TABLE "dimgeography" (\n"index" INTEGER...
12  CREATE INDEX "ix_dimgeography_index"ON "dimgeo...
13  CREATE TABLE dimproduct (\n    ProductKey     ...
14  CREATE TABLE "product" (\n"index" INTEGER,\n  ...
15  CREATE INDEX "ix_product_index"ON "product" ("...

In [20]:
df =pd.DataFrame(rows , columns=[column[0] for column in cur.description] )
df.to_csv('output.csv' )

In [17]:
pd.read_sql_query('SELECT * FROM student limit 3' , conn)

,id,name,class_,section,gender,grade,teacher_name,address,contact,fee,driver_contact,transport_fee,uniform_dues,books_dues,admission_fee,paper_money,fee_status
0,1,alyar,2,RED,Male,A,ali,pabbi,333,2000,345,1000.0,400.0,300.0,300.0,300.0,Paid
1,3,arfa jani,1,YELLOW,Female,D,maryam,PABBI,335,1000,345,1200.0,200.0,1000.0,1000.0,400.0,Unpaid
2,4,azam,3,RED,Male,A,ali,pabbi,345,3000,3331234567,300.0,0.0,0.0,0.0,0.0,Paid

In [10]:
pd.read_sql_query("SELECT * FROM student where name ='alyar' " , conn)

,id,name,class_,section,gender,grade,teacher_name,address,contact,fee,driver_contact,transport_fee,uniform_dues,books_dues,admission_fee,paper_money,fee_status
0,1,alyar,2,RED,Male,A,ali,pabbi,333,2000,345,1000.0,400.0,300.0,300.0,300.0,Paid

In [11]:
pd.read_sql_query("SELECT name , section , gender , teacher_name , address FROM student where name ='alyar' " , conn)

    name section gender teacher_name address
0  alyar     RED   Male          ali   pabbi

# Pandasql

In [36]:
from pandasql import sqldf

# def pysqldf(q):
#     """this function eliminates the need to include locals/globals all the time"""
#     return sqldf('q', globals())

In [89]:
data = pd.read_csv('Data/DimDate.csv')
date = data[data['DateKey'] > 20111231]

In [62]:
def psqldf(query):
    return sqldf(query , globals())

In [63]:
psqldf('''select * from date limit 3''')

,DateKey,FullDateAlternateKey,DayNumberOfWeek,EnglishDayNameOfWeek,SpanishDayNameOfWeek,FrenchDayNameOfWeek,DayNumberOfMonth,DayNumberOfYear,WeekNumberOfYear,EnglishMonthName,SpanishMonthName,FrenchMonthName,MonthNumberOfYear,CalendarQuarter,CalendarYear,CalendarSemester,FiscalQuarter,FiscalYear,FiscalSemester
0,20120101,2012-01-01,1,Sunday,Domingo,Dimanche,1,1,1,January,Enero,Janvier,1,1,2012,1,3,2011,2
1,20120102,2012-01-02,2,Monday,Lunes,Lundi,2,2,1,January,Enero,Janvier,1,1,2012,1,3,2011,2
2,20120103,2012-01-03,3,Tuesday,Martes,Mardi,3,3,1,January,Enero,Janvier,1,1,2012,1,3,2011,2

these are the table in sqlite databases

* databases name -> school
* table name -> dimate

In [131]:
dimdate = '''
DROP TABLE IF EXISTS dimdate;

CREATE TABLE dimdate (
    DateKey                INTEGER NOT NULL PRIMARY KEY,
    DateValue              DATE    NOT NULL,
    DayNumberOfWeek        INTEGER NOT NULL,
    DayNameOfWeek          TEXT    NOT NULL,
    DayNumberOfMonth       INTEGER NOT NULL,
    DayNumberOfYear        INTEGER NOT NULL,
    WeekNumberOfYear       INTEGER NOT NULL,
    MonthName              TEXT NOT NULL,
    MonthNumberOfYear      INTEGER NOT NULL,
    CalendarQuarter        INTEGER NOT NULL,
    CalendarYear           INTEGER NOT NULL,
    FiscalQuarter          INTEGER NOT NULL,
    FiscalYear             INTEGER NOT NULL 
);
'''

create table in dimdate in schoool sqlite database

In [132]:
cur.executescript(dimdate)

fetch the data in csv file

In [133]:
psqldf(''' 
select  DateKey           
       ,FullDateAlternateKey as DateValue         
       ,DayNumberOfWeek   
       ,EnglishDayNameOfWeek as DayNameOfWeek     
       ,DayNumberOfMonth   
       ,DayNumberOfYear   
       ,WeekNumberOfYear  
       ,EnglishMonthName as MonthName         
       ,MonthNumberOfYear 
       ,CalendarQuarter   
       ,CalendarYear      
       ,FiscalQuarter     
       ,FiscalYear   
from data;
''').to_sql('dimdate', conn, index=False, if_exists='append')
# data is csv file object 
# data.to_sql('table_name  of creating  in school databaes', conn , if_exits='relace'

3652

pndas load the csv file in sqlite database  without creating table in database
<br>
it directly created in a table in school  databases

In [93]:
# data.to_sql('dimate', conn, if_exists='replace', index=False)

fetch the all row in dimate table

In [134]:
cur.execute('select  count(DateKey)  from dimdate').fetchall()

[(3652,)]

display the dimate table in sqlite database

In [135]:
# for row in cur.execute('select * from dimdate'):
#     print(row)

## Do Not Use AutoIncrement Keyword
https://sqlite.org/autoinc.html

In [136]:
factinternetsales = '''

DROP TABLE IF EXISTS factinternetsales;

CREATE TABLE factinternetsales(
    ID                   INTEGER    NOT NULL PRIMARY KEY,
    ProductKey            int      NOT NULL ,
    OrderDateKey           int      NOT NULL,
    DueDateKey             int      NOT NULL,
    ShipDateKey            int      NOT NULL,
    CustomerKey            int      NOT NULL,
    PromotionKey           int      NOT NULL,
    CurrencyKey            int      NOT NULL,
    SalesTerritoryKey      int      NOT NULL,
    OrderQuantity          smallint NOT NULL,
    UnitPrice              money    NOT NULL,
    UnitPriceDiscountPct   float    NOT NULL,
    DiscountAmount         float    NOT NULL,
    ProductStandardCost    money    NOT NULL,
    TotalProductCost       money    NOT NULL,
    SalesAmount            money    NOT NULL  CHECK (SalesAmount >= 0 ),
    TaxAmt                 money    NOT NULL,
    Freight                money    NOT NULL,
    OrderDate              datetime  NULL,
    DueDate                datetime  NULL,
    ShipDate               datetime  NULL,
    TaxRate                real     NULL  DEFAULT 0, 
    ProfitMargin           real     NULL,
    InsertDate             TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,
    FOREIGN KEY(ProductKey)        REFERENCES dimproduct(ProductKey),
    FOREIGN KEY(SalesTerritoryKey) REFERENCES dimsalesterritory(SalesTerritoryKey)
);
'''

In [137]:
cur.executescript(factinternetsales)

In [138]:
sales = pd.read_csv('data/FactInternetSales2014.csv')

In [124]:
# it's directly  excecute in the factinternetsales table
# sales.to_sql('factinternetsales' , conn , if_exists='append')

In [141]:
psqldf( '''
SELECT 
       ProductKey,
       OrderDateKey,
       DueDateKey,
       ShipDateKey,
       CustomerKey,
       PromotionKey,
       CurrencyKey,
       SalesTerritoryKey,
       OrderQuantity,
       UnitPrice,
       UnitPriceDiscountPct,
       DiscountAmount,
       ProductStandardCost,
       TotalProductCost,
       SalesAmount,
       TaxAmt,
       Freight,
       OrderDate,
       DueDate,
       ShipDate,
       round((TaxAmt/SalesAmount),2) as TaxRate,
       round(((SalesAmount - TotalProductCost ) / SalesAmount), 2) as ProfitMargin
  FROM sales  
''').to_sql('factinternetsales', conn, index=False, if_exists='replace')

1970

#  salesterrritory

In [152]:
dimasale = pd.read_csv('data/DimSalesTerritory.csv')

In [155]:
psqldf('''select SalesTerritoryKey, 
         SalesTerritoryRegion, 
         SalesTerritoryCountry, 
         SalesTerritoryGroup from dimasale;''').to_sql('dimasale' , conn , if_exists='append')

11

# Create a unique index non the table.

In [159]:
cur.executescript('''
BEGIN TRANSACTION;
create unique index if not exists idx_salesterritorykey on dimasale (SalesTerritoryKey);  
commit;
 ''')

In [172]:
geography = pd.read_csv('data/DimGeography.csv')

In [168]:
create_geography = '''
DROP TABLE IF EXISTS dimgeography;

CREATE TABLE IF NOT EXISTS dimgeography (
    GeographyKey                INTEGER PRIMARY KEY,
    City                        TEXT,
    StateProvinceCode           TEXT,
    StateProvinceName           TEXT,
    CountryRegionCode           TEXT,
    CountryRegionName           TEXT,
    PostalCode                  TEXT,
    SalesTerritoryKey           INTEGER NOT NULL,  
    InsertDate                  TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,
    FOREIGN KEY (SalesTerritoryKey)
       REFERENCES dimsalesterritory (SalesTerritoryKey) 
);
'''

In [170]:
cur.executescript(create_geography)

In [187]:
# Store the results in our SQLite data warehouse
psqldf('''
       select  GeographyKey,
        City,                        
        StateProvinceCode,           
        StateProvinceName,           
        CountryRegionCode,           
        EnglishCountryRegionName as CountryRegionName,           
        PostalCode,                  
        SalesTerritoryKey  
from geography
''').to_sql('dimgeography', conn , if_exists='replace')

655

In [325]:
productsubcategory = pd.read_csv('data/DimProductSubCategory.csv')
productcategory = pd.read_csv('./data/DimProductCategory.csv')
dfproduct = pd.read_csv('data/DimProduct.csv')

In [199]:
create_dimproduct = '''
drop table if exists dimproduct;
CREATE TABLE IF NOT EXISTS dimproduct (
    ProductKey          INTEGER PRIMARY KEY,
    Category            TEXT,
    SubCategory         TEXT,
    Product             TEXT,
    Model               TEXT,
    ListPrice           FLOAT,
    InsertDate        TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP
);
'''

In [200]:
cur.executescript(create_dimproduct)

#### We use an inner join even though a product could have a null ProductSubcategoryKey.

In [280]:
sql = '''
SELECT ProductKey,
       EnglishProductCategoryName as Category,
       sc.EnglishProductSubcategoryName as SubCategory,
       p.EnglishProductName as Product,
       p.ModelName as Model,
       ifnull(round(p.ListPrice,2), 0) as ListPrice
FROM dfproduct                       p
INNER JOIN productsubcategory      sc
  ON (p.ProductSubcategoryKey = sc.ProductSubcategoryKey)
INNER JOIN productcategory         pc
  ON (sc.ProductCategoryKey = pc.ProductCategoryKey)
'''

### store data in product  table  tothe selected column of above

In [298]:
# Store the results in our SQLite data  on the databaes
# if_exists options are replace, append, 

product_data =psqldf(sql)

In [299]:
product_data.head()

,ProductKey,Category,SubCategory,Product,Model,ListPrice
0,210,Components,Road Frames,"HL Road Frame - Black, 58",HL Road Frame,0.00
1,211,Components,Road Frames,"HL Road Frame - Red, 58",HL Road Frame,0.00
2,212,Accessories,Helmets,"Sport-100 Helmet, Red",Sport-100,33.64
3,213,Accessories,Helmets,"Sport-100 Helmet, Red",Sport-100,33.64
4,214,Accessories,Helmets,"Sport-100 Helmet, Red",Sport-100,34.99

In [300]:
product_data.to_sql('product', conn , if_exists='append')

397

In [311]:
# table schema
pd.read_sql_query("""PRAGMA table_info('product');""", conn)

   cid         name     type  notnull dflt_value  pk
0    0        index  INTEGER        0       None   0
1    1   ProductKey  INTEGER        0       None   0
2    2     Category     TEXT        0       None   0
3    3  SubCategory     TEXT        0       None   0
4    4      Product     TEXT        0       None   0
5    5        Model     TEXT        0       None   0
6    6    ListPrice     REAL        0       None   0

In [336]:
pd.read_sql_query("SELECT * FROM product limit 1 ", conn)

,index,ProductKey,Category,SubCategory,Product,Model,ListPrice
0,0,210,Components,Road Frames,"HL Road Frame - Black, 58",HL Road Frame,0.0

In [347]:
pd.read_sql_query('''
                  select Category, SubCategory, Product, round(sum(SalesAmount),2) as SalesAmount  
                  from factinternetsales fc
                  inner join  product p
                  on fc.ProductKey = p.ProductKey  
                 group by Category, SubCategory, Product                 
                  ''' , conn).head()

      Category        SubCategory                 Product  SalesAmount
0  Accessories         Bike Racks     Hitch Rack - 4-Bike      7200.00
1  Accessories        Bike Stands  All-Purpose Bike Stand      5247.00
2  Accessories  Bottles and Cages    Mountain Bottle Cage      2097.90
3  Accessories  Bottles and Cages        Road Bottle Cage       242.73
4  Accessories  Bottles and Cages   Water Bottle - 30 oz.      2185.62

In [365]:
sql = ''' select 
t.SalesTerritoryCountry, t.SalesTerritoryRegion, SUM(SalesAmount) as Amount
FROM  factinternetsales   s
JOIN  dimasale   t
ON (s.SalesTerritoryKey = t.SalesTerritoryKey)
GROUP BY SalesTerritoryCountry, SalesTerritoryRegion
ORDER BY SUM(SalesAmount) DESC '''

In [370]:
pd.read_sql_query(sql, conn , index_col=['SalesTerritoryCountry']).round(2)

                      SalesTerritoryRegion   Amount
SalesTerritoryCountry
Canada                              Canada  9457.62
United States                    Northwest  9091.81
Australia                        Australia  8507.72
United States                    Southwest  8376.06
United Kingdom              United Kingdom  3713.64
Germany                            Germany  3277.83
France                              France  3195.06
United States                    Southeast    74.98

In [374]:
# close connection
cur.close()
conn.close()

In [312]:
import cx_Oracle

In [371]:
cx_conn = cx_Oracle.Connection('system/tiger@localhost:1521/xe')

In [372]:
curr  = conn.cursor()

In [373]:
pd.read_sql_query('select * from emp', cx_conn)

C:\Users\hp\AppData\Local\Temp\ipykernel_2128\2180474113.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query('select * from emp', cx_conn)

    EMPNO   ENAME        JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0    7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN      30
6    7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-04-19  3000.0     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-05-23  1100.0     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN      10

In [ ]:
# close connection
cur.close()
conn.close()